# a = 3 + 3.0 + 4
# print(a)
# print(type(a))


'''№8
Какой результат дадут выражения int(5.2) и math.trunc(5.2)? Есть ли разница при любых случайных аргументах?
Что функция int(), что метод trunc() из модуля math дают одинаковые результаты. По факту, это аналоги, реализующие следующий механизм: отсекается дробная часть и возвращается целочисленное значение с сохранением знака.
Какие бы аргументы мы сюда не передавали, итог вычисления всегда будет одинаковым.'''

# from math import trunc
# print(int(5.2))
# print(trunc(5.2))
# print(int(5.2) == trunc(5.2))







